lkolbly/cmsis-svd/data/TexasInstruments/LM3S9DN6.svd
        <register>
          <name>DBG_XFER</name>
          <description>Debug Core Reg. Transfer Select</description>
          <addressOffset>0x00000DF4</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_XFER_REG_SEL</name>
              <description>Register</description>
              <bitRange>[4:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R0</name>
                  <description>Register R0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R1</name>
                  <description>Register R1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R2</name>
                  <description>Register R2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R3</name>
                  <description>Register R3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R4</name>
                  <description>Register R4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R5</name>
                  <description>Register R5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R6</name>
                  <description>Register R6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R7</name>
                  <description>Register R7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R8</name>
                  <description>Register R8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R9</name>
                  <description>Register R9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R10</name>
                  <description>Register R10</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R11</name>
                  <description>Register R11</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R12</name>
                  <description>Register R12</description>
                  <value>0xc</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R13</name>
                  <description>Register R13</description>
                  <value>0xd</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R14</name>
                  <description>Register R14</description>
                  <value>0xe</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_R15</name>
                  <description>Register R15</description>
                  <value>0xf</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_FLAGS</name>
                  <description>xPSR/Flags register</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_MSP</name>
                  <description>Main SP</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_PSP</name>
                  <description>Process SP</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_DSP</name>
                  <description>Deep SP</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NVIC_DBG_XFER_REG_CFBP</name>
                  <description>Control/Fault/BasePri/PriMask</description>
                  <value>0x14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_DBG_XFER_REG_WNR</name>
              <description>Write or not read</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_DATA</name>
          <description>Debug Core Register Data</description>
          <addressOffset>0x00000DF8</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_DATA</name>
              <description>Data temporary cache</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_INT</name>
          <description>Debug Reset Interrupt Control</description>
          <addressOffset>0x00000DFC</addressOffset>
          <fields>
            <field>
              <name>NVIC_DBG_INT_RSTVCATCH</name>
              <description>Reset vector catch</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_RSTPENDING</name>
              <description>Core reset is pending</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_RSTPENDCLR</name>
              <description>Clear pending core reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_RESET</name>
              <description>Core reset status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_MMERR</name>
              <description>Debug trap on mem manage fault</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_NOCPERR</name>
              <description>Debug trap on coprocessor error</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_CHKERR</name>
              <description>Debug trap on usage fault check</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_STATERR</name>
              <description>Debug trap on usage fault state</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_BUSERR</name>
              <description>Debug trap on bus error</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_INTERR</name>
              <description>Debug trap on interrupt errors</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NVIC_DBG_INT_HARDERR</name>
              <description>Debug trap on hard fault</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_TRIG</name>
          <description>Software Trigger Interrupt</description>
          <addressOffset>0x00000F00</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>NVIC_SW_TRIG_INTID</name>
              <description>Interrupt ID</description>
              <bitRange>[5:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <memory>
      <name>FLASH</name>
      <description>FLASH Memory Map for lm3s9dn6</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00080000</size>
        <usage>FLASH Memory</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>ROM</name>
      <description>ROM Memory Map for lm3s9dn6</description>
      <baseAddress>0x01000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00006a00</size>
        <usage>ROM Boot Loader/StellarisWare</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x01000000</offset>
        <size>0x00000100</size>
        <usage>Safe RTOS Region 1</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x01000600</offset>
        <size>0x00000d00</size>
        <usage>Safe RTOS Region 2</usage>
      </addressBlock>
    </memory>
    <memory>
      <name>SRAM</name>
      <description>SRAM Memory Map for lm3s9dn6</description>
      <baseAddress>0x20000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00018000</size>
        <usage>SRAM</usage>
      </addressBlock>
    </memory>
  </vendorExtensions>
</device>
